/*
指定された物体の影を表示するクラス
作成日：2021/09/23
*/
#include "pch.h"
#include "Shadow.h"

/*=========================================================================
コンストラクタ
=========================================================================*/
Shadow::Shadow()
	:
	FlatPolygon()
{
}

/*=========================
デストラクタ
=========================*/
Shadow::~Shadow()
{

}

/*==================================
ラップした初期化
===================================*/
void Shadow::WrapInitialize()
{
	//派生元の初期化処理
	this->Initialize();

	//画像を設定する
	this->SetTexture("Shadow");
}

